In [2]:
import pandas as pd
df=pd.read_csv(r"c:\Users\prasa\OneDrive\Documents\Downloads\sample_transactions.csv")
df.head()

  Customer Name  Account Number  Phone Number Transaction Date    Amount
0   Aarav Mehta    123456789012    9876543210       2025-12-01  15000.50
1  Priya Sharma    987654321098    9123456789       2025-12-03  23400.75
2   Rohan Verma    456789123456    9988776655       2025-12-05   1200.00
3    Sneha Iyer    321654987321    9090909090       2025-12-10   8900.25
4   Karan Patel    789123456789    9876501234       2025-12-12  45000.00